In [35]:
import pandas as pd
from pathlib import Path

In [36]:
csv_path = Path("nasdaq_yahoo_finance.csv")

In [37]:
nasdaq_95 = pd.read_csv(csv_path)
nasdaq_95.head()

,Date,Open,High,Low,Close,Adj Close,Volume
0,1995-01-03,751.309998,751.309998,743.530029,743.580017,743.580017,248750000
1,1995-01-04,744.770020,746.419983,740.469971,745.840027,745.840027,290350000
2,1995-01-05,746.869995,748.500000,745.130005,745.659973,745.659973,297510000
3,1995-01-06,746.270020,750.729980,745.760010,749.690002,749.690002,312920000
4,1995-01-09,750.190002,752.840027,750.099976,752.090027,752.090027,267090000

In [38]:
nasdaq_95.dtypes

Date          object
Open         float64
High         float64
Low          float64
Close        float64
Adj Close    float64
Volume         int64
dtype: object

In [39]:
nasdaq_95.drop(columns=['Open', 'High', 'Low', 'Close'], inplace=True)
nasdaq_95.head()

         Date   Adj Close     Volume
0  1995-01-03  743.580017  248750000
1  1995-01-04  745.840027  290350000
2  1995-01-05  745.659973  297510000
3  1995-01-06  749.690002  312920000
4  1995-01-09  752.090027  267090000

In [40]:
nasdaq_95.isnull()

       Date  Adj Close  Volume
0     False      False   False
1     False      False   False
2     False      False   False
3     False      False   False
4     False      False   False
...     ...        ...     ...
2766  False      False   False
2767  False      False   False
2768  False      False   False
2769  False      False   False
2770  False      False   False

[2771 rows x 3 columns]

In [42]:
nasdaq_95.isnull().sum()

Date         0
Adj Close    0
Volume       0
dtype: int64

In [43]:
nasdaq_95.duplicated()

0       False
1       False
2       False
3       False
4       False
        ...
2766    False
2767    False
2768    False
2769    False
2770    False
Length: 2771, dtype: bool

In [44]:
nasdaq_95.head()

         Date   Adj Close     Volume
0  1995-01-03  743.580017  248750000
1  1995-01-04  745.840027  290350000
2  1995-01-05  745.659973  297510000
3  1995-01-06  749.690002  312920000
4  1995-01-09  752.090027  267090000

In [45]:
nasdaq_95.to_csv("nasdaq_95_cleaned.csv", index=False)